## Drift Report for production

Detected at: Thu Mar  5 12:05:23 UTC 2026

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.mybucket will be created
  + resource "google_storage_bucket" "mybucket" {
      + effective_labels            = {
          + "environment"                = "dev"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
        }
      + location                    = "US"
      + name                        = "terraform-drift-demo-2024"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "environment"                = "dev"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
